// Задание 3
/*Напишите код, который:
* Запрашивает по очереди значения при помощи prompt и сохраняет их в массиве.
* Заканчивает ввод, как только посетитель введёт пустую строку, не число или нажмёт
«Отмена».
* При этом ноль 0 не должен заканчивать ввод, это разрешённое число.
* Выводит сумму всех значений массива когда ввод прекращен. */
"use strict";
var arrNum = []; // создаем массив куда будем записывать значения введенные пользователем
var num; // переменная для записи ответа пользователя
var sum = 0; // переменная для записи суммы всех значений массива arrNum

do {                                        // используем цикл do-while 
  num = +prompt('Введите число?','');        // просим пользователя ввести число
    //   if (!isFinite(num))
  if (!typeof(num) === "number" || num === null || num == '') // пока условие истинно вопрос задается многократно
    {break;                                                   // когда условие ложно цикл заканчивается и выполняется действие
    }
    arrNum .push(+num); // добавление значений введенных пользователем в массив при помощи метода push();
    // arrNum .unshift(+num);          // или при помощи метода unshift();
    console.log(arrNum);
  }
while (true)
  sum = arrNum.reduce((sum, current) => sum + current);  // при помощи метода reduce() высчитываем сумму значений массива
  console.log(sum);
  alert('Cумма всех значений массива = ' + sum);