"use strict";
// Задание 1
// Напишите программу, создающую строку, содержащую решётку 8х8, в
// которой линии разделяются символами новой строки. На каждой позиции
// либо пробел, либо \#. В результате должна получиться следующая структура:
// # # # #
//  # # # #
// # # # #
//  # # # #
// # # # #
//  # # # #
// # # # #
//  # # # #

// Когда справитесь, сделайте размер доски переменным, чтобы можно было
// создавать доски любого размера.

function chessBoard() {
    var str = '';
    var lim = 8;
    for (var i = 0; i < lim; i++) {         // цикл для перебора строк
        for (var j = 0; j < lim; i++) {     // внутренний цикл перебирающий нечетные строки
          if (i % 2 == 0) {                 // если строка не четная
            str +=  j / 2 === 0 ? ' ' : '#';  // канкатенируем значение со строкой
          } else {                           // если строка четная
            str +=  j / 2 === 0 ? '#' : ' ';  // канкатенируем значение со строкой
          }      
        }
        str += '\n';         
    }
    return str;                   
}
console.log(chessBoard());


