// Задание 1
// Напишите программу, создающую строку, содержащую решётку 8х8, в
// которой линии разделяются символами новой строки. На каждой позиции
// либо пробел, либо \#. В результате должна получиться следующая структура:
// # # # #
//  # # # #
// # # # #
//  # # # #
// # # # #
//  # # # #
// # # # #
//  # # # #

// Когда справитесь, сделайте размер доски переменным, чтобы можно было
// создавать доски любого размера.
"use strict";

var str = '';
var lim = 8;
for (var i = 0; i < lim; i++) {         // цикл для перебора строк
  for (var j = 0; j < lim; j++) {     // внутренний цикл перебирающий нечетные строки
    if ((i + j) % 2 == 0) {                 // если строка не четная
      str += ' ';                     // канкатенируем значение со строкой
    } else {                           // если строка четная
      str += '#';          // канкатенируем значение со строкой
    }      
  }
  str += '\n';         
}
console.log(str);               
